---
type: AdvancedMetal
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 8
tags: [revit-api, class]
---

# AdvancedMetal

`Autodesk.Revit.DB.Visual.AdvancedMetal` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | MetalF0 | 2018.1 | `public static string MetalF0 { get ; }` |
| Property | SurfaceAlbedo | 2018.1 | `public static string SurfaceAlbedo { get ; }` |
| Property | SurfaceAnisotropy | 2018.1 | `public static string SurfaceAnisotropy { get ; }` |
| Property | SurfaceCutout | 2018.1 | `public static string SurfaceCutout { get ; }` |
| Property | SurfaceNdfType | 2018.1 | `public static string SurfaceNdfType { get ; }` |
| Property | SurfaceNormal | 2018.1 | `public static string SurfaceNormal { get ; }` |
| Property | SurfaceRotation | 2018.1 | `public static string SurfaceRotation { get ; }` |
| Property | SurfaceRoughness | 2018.1 | `public static string SurfaceRoughness { get ; }` |